app/controllers/pplacas_controller.rb

SELECT "pplacas".* FROM "pplacas"
---
  def index
  	@pplaca = Pplaca.all

INSERT INTO "pplacas" ("placa", "fecha", "hora", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["placa", "ABB-1554"], ["fecha", Mon, 02 Jan 2017], ["hora", 2000-01-01 03:06:00 UTC], ["created_at", 2017-01-18 16:25:15 UTC], ["updated_at", 2017-01-18 16:25:15 UTC]]
---
  def create
  	@pplaca = Pplaca.new(pplaca_params)
  	#@pplaca.save
  	if @pplaca.save

SELECT  "pplacas".* FROM "pplacas" WHERE "pplacas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@pplaca=Pplaca.find(params[:id])

SELECT  "pplacas".* FROM "pplacas" WHERE "pplacas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pplacas" SET "placa" = ?, "updated_at" = ? WHERE "pplacas"."id" = ?  [["placa", "DFR-7485"], ["updated_at", 2017-01-18 17:09:07 UTC], ["id", 1]]
---
  def update
  	@pplaca = Pplaca.find(params[:id])
  	if @pplaca.update(pplaca_params)

SELECT  "pplacas".* FROM "pplacas" WHERE "pplacas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
  	@pplaca = Pplaca.find(params[:id])

SELECT  "pplacas".* FROM "pplacas" WHERE "pplacas"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "pplacas" WHERE "pplacas"."id" = ?  [["id", 5]]
---
  def destroy
  	@pplaca = Pplaca.find(params[:id])
  	@pplaca.destroy